app/controllers/items_controller.rb

INSERT INTO "items" ("name", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "rawr"], ["user_id", 1], ["created_at", "2018-02-13 17:53:14.986006"], ["updated_at", "2018-02-13 17:53:14.986006"]]
---
  def create
    @item = Item.new(item_params)

    if @item.save

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT 1  [["id", 16]]
DELETE FROM "items" WHERE "items"."id" = ?  [["id", 16]]
---
  def destroy
    @item = Item.find(params[:id])

    if @item.destroy